{
  "id": "erdos-559",
  "title": "Erdős Problem #559: Size Ramsey Numbers for Bounded Degree Graphs",
  "slug": "erdos-559",
  "description": "Does R̂(G) ≪_d n for bounded-degree graphs G? DISPROVED for d ≥ 3 by Rödl-Szemerédi (2000). The size Ramsey number R̂(G) is the minimum edges m such that some graph H with m edges is Ramsey for G.",
  "meta": {
    "author": "Beck, Erdős",
    "sourceUrl": "https://erdosproblems.com/559",
    "date": "1983",
    "status": "complete",
    "proofRepoPath": "Proofs/Erdos559Problem.lean",
    "tags": [
      "erdos",
      "ramsey-theory",
      "graph-theory",
      "extremal-combinatorics"
    ],
    "badge": "mathlib",
    "sorries": 11,
    "erdosNumber": 559,
    "erdosUrl": "https://erdosproblems.com/559",
    "erdosProblemStatus": "solved"
  },
  "overview": {
    "historicalContext": "This problem was posed by Beck in 1983, with possible prior interest from Erdős. Beck's original paper proved the conjecture for paths. The problem asks whether the size Ramsey number—the minimum number of edges in a graph H that is Ramsey for G—is linear in n for bounded-degree graphs G with n vertices. This is a natural question connecting extremal graph theory with Ramsey theory.",
    "problemStatement": "Let R̂(G) denote the size Ramsey number: the minimal number of edges m such that there exists a graph H with m edges that is Ramsey for G (any 2-coloring of H's edges contains a monochromatic copy of G). Conjecture (Beck/Erdős): If G has n vertices and maximum degree d, then R̂(G) ≪_d n (i.e., R̂(G) = O_d(n), linear in n with constant depending on d).",
    "proofStrategy": "The conjecture was DISPROVED for d ≥ 3. The formalization captures: (1) Basic graph definitions with FiniteGraph structure, edge counting, degree functions. (2) The Ramsey property and size Ramsey number definition. (3) The Beck-Erdős conjecture statement and its negation. (4) Positive special cases where linearity holds (paths, trees, cycles). (5) Counterexamples showing superlinear lower bounds for degree-3 graphs. (6) Best known upper bounds showing polynomial growth.",
    "keyInsights": [
      "The conjecture HOLDS for restricted graph classes: paths (Beck 1983), trees (Friedman-Pippenger 1987), cycles (Haxell-Kohayakawa-Luczak 1995)",
      "The conjecture FAILS for general degree-3 graphs, with counterexamples by Rödl-Szemerédi (2000) achieving R̂(G) ≫ n(log n)^c",
      "Tikhomirov (2022) improved the lower bound to R̂(G) ≫ n·exp(c√(log n))",
      "Best upper bounds for degree-3 graphs are polynomial: n^{3/2+o(1)} by Draganić-Petrova (2022)",
      "The exact growth rate for degree-3 graphs remains a major open problem, with a substantial gap between lower and upper bounds"
    ]
  },
  "sections": [
    {
      "title": "Basic Definitions",
      "startLine": 48,
      "endLine": 71,
      "summary": "Defines FiniteGraph structure with adjacency, symmetry, looplessness. Includes edgeCount (counting unordered pairs), degree (neighbors of a vertex), and maxDegree (supremum over all vertices)."
    },
    {
      "title": "Ramsey Property and Size Ramsey Number",
      "startLine": 73,
      "endLine": 92,
      "summary": "Defines IsRamseyFor: H is Ramsey for G if any 2-coloring of H's edges contains a monochromatic copy of G. The size Ramsey number sizeRamsey(G) is the minimum edges needed for such an H."
    },
    {
      "title": "The Beck-Erdős Conjecture (Disproved)",
      "startLine": 94,
      "endLine": 109,
      "summary": "States the conjecture: for each d ≥ 1, there exists c > 0 such that R̂(G) ≤ c·n for all n-vertex graphs G with maximum degree at most d. The theorem beck_erdos_conjecture_false asserts this is false."
    },
    {
      "title": "Positive Results (Special Cases)",
      "startLine": 111,
      "endLine": 150,
      "summary": "Formalizes the classes where linearity DOES hold: IsPath, IsTree, IsCycle definitions and theorems beck_paths, friedman_pippenger_trees, haxell_kohayakawa_luczak_cycles proving R̂(G) = O(n) for these families."
    },
    {
      "title": "Counterexamples (d = 3)",
      "startLine": 152,
      "endLine": 171,
      "summary": "The key negative results: rodl_szemeredi_counterexample shows degree-3 graphs can have R̂(G) ≫ n(log n)^c; tikhomirov_improved_lower_bound achieves R̂(G) ≫ n·exp(c√(log n))."
    },
    {
      "title": "Upper Bounds for Degree-3",
      "startLine": 173,
      "endLine": 200,
      "summary": "Best known upper bounds: Kohayakawa et al. n^{5/3+o(1)}, Conlon-Nenadov-Trujić n^{8/5}, Draganić-Petrova n^{3/2+o(1)} (current best)."
    },
    {
      "title": "The Open Question",
      "startLine": 202,
      "endLine": 218,
      "summary": "The remaining challenge: what is the exact growth rate for degree-3 graphs? Currently bounded between n·exp(c√(log n)) and n^{3/2+o(1)}, a substantial gap."
    }
  ],
  "conclusion": {
    "summary": "Erdős Problem #559 asked whether size Ramsey numbers are linear for bounded-degree graphs. This was DISPROVED for d ≥ 3 by Rödl-Szemerédi (2000). The conjecture holds for special graph classes (paths, trees, cycles), but general degree-3 graphs can have superlinear size Ramsey numbers. The exact growth rate for d = 3 remains open, with current bounds ranging from n·exp(c√(log n)) to n^{3/2+o(1)}.",
    "implications": "This result shows that Ramsey theory for sparse graphs is more complex than anticipated. The linear bound fails even at degree 3, yet the true behavior is neither fully linear nor polynomial—it lies in an intermediate regime that is still not well-understood.",
    "openQuestions": [
      "What is the exact growth rate of R̂(G) for degree-3 graphs?",
      "Can the gap between n·exp(c√(log n)) and n^{3/2+o(1)} be closed?",
      "For which specific degree-3 graph families does linearity hold?",
      "What happens at degree d = 2 (beyond cycles)?"
    ]
  }
}
