{
  "id": "erdos-1007",
  "title": "Erdős Problem #1007: Graph Dimension",
  "slug": "erdos-1007",
  "description": "What is the smallest number of edges in a graph with dimension 4? The answer is 9, achieved uniquely by K_{3,3}. Graph dimension is the minimum Euclidean dimension for unit-distance embedding.",
  "meta": {
    "author": "House (2013) / Chaffee-Noble (2016)",
    "sourceUrl": "https://erdosproblems.com/1007",
    "date": "2013",
    "status": "complete",
    "proofRepoPath": "Proofs/Erdos1007Problem.lean",
    "tags": [
      "erdos",
      "graph-theory",
      "geometry",
      "dimension",
      "unit-distance",
      "embedding"
    ],
    "badge": "wip",
    "sorries": 1,
    "erdosNumber": 1007,
    "erdosUrl": "https://erdosproblems.com/1007",
    "erdosProblemStatus": "solved"
  },
  "overview": {
    "historicalContext": "The notion of graph dimension was introduced by Erdős, Harary, and Tutte. A graph has dimension d if it can be embedded in ℝᵈ with all edges as unit segments, but not in ℝᵈ⁻¹. Erdős posed this specific question to Soifer in January 1992, asking for the minimum edges in a dimension-4 graph.",
    "problemStatement": "The dimension of a graph G is the minimal n such that G can be embedded in ℝⁿ with every edge as a unit line segment. What is the smallest number of edges in a graph with dimension 4?",
    "proofStrategy": "House (2013) proved the minimum is 9 edges through careful analysis of unit distance constraints. The key insight is that K_{3,3} requires 4 dimensions because its bipartite structure creates distance constraints that cannot be satisfied in ℝ³. Any graph with fewer than 9 edges can be shown to embed in ℝ³.",
    "keyInsights": [
      "K₂ has dimension 1, K₃ has dimension 2, K₄ has dimension 3",
      "K_{3,3} with 9 edges is the UNIQUE minimum for dimension 4",
      "The bipartite structure of K_{3,3} creates rigid constraints forcing 4D",
      "For dimension 5, the minimum is 15 edges (achieved by K₆ and K_{1,3,3})",
      "Graph dimension connects combinatorics with Euclidean geometry"
    ]
  },
  "sections": [
    {
      "id": "dimension",
      "title": "Graph Dimension",
      "summary": "Definition of graph dimension as minimum embedding dimension",
      "startLine": 49,
      "endLine": 67
    },
    {
      "id": "bipartite",
      "title": "Complete Bipartite Graphs",
      "summary": "Definition of K_{m,n} and the K_{3,3} structure",
      "startLine": 69,
      "endLine": 81
    },
    {
      "id": "known",
      "title": "Known Dimensions",
      "summary": "Dimension results for complete graphs K₃, K₄",
      "startLine": 83,
      "endLine": 94
    },
    {
      "id": "main",
      "title": "Main Result: 9 Edges Minimum",
      "summary": "House's theorem that K_{3,3} is the unique minimum",
      "startLine": 96,
      "endLine": 115
    },
    {
      "id": "extension",
      "title": "Dimension 5 Extension",
      "summary": "Chaffee-Noble result on dimension 5 minimum",
      "startLine": 117,
      "endLine": 131
    }
  ],
  "conclusion": {
    "summary": "The minimum number of edges in a dimension-4 graph is exactly 9, achieved uniquely by K_{3,3}. This beautiful result connects graph combinatorics with Euclidean geometry through unit-distance embeddings.",
    "implications": "Graph dimension is a natural geometric invariant of graphs. The K_{3,3} result shows that bipartite graphs can have high dimension despite their simple structure. The uniqueness of K_{3,3} is remarkable.",
    "openQuestions": [
      "What is the minimum edges for dimension d in general?",
      "Characterize all graphs achieving the minimum for each dimension",
      "Computational complexity of determining graph dimension"
    ]
  }
}