{
  "id": "erdos-139",
  "title": "Erdős #139: Szemerédi's Theorem",
  "slug": "erdos-139",
  "description": "Szemerédi's theorem states that any subset of natural numbers with positive upper density contains arbitrarily long arithmetic progressions. This formalization covers the equivalent density formulation: r_k(N) = o(N), where r_k(N) is the maximum size of a k-AP-free subset of {1,...,N}.",
  "meta": {
    "author": "Endre Szemerédi (solver), Erdős-Turán (conjecture)",
    "sourceUrl": "https://erdosproblems.com/139",
    "date": "1975",
    "status": "axiomatized",
    "proofRepoPath": "Proofs/Erdos139Problem.lean",
    "tags": [
      "erdos",
      "combinatorics",
      "arithmetic-progressions",
      "density",
      "szemerédi"
    ],
    "badge": "wip",
    "sorries": 1,
    "erdosNumber": 139,
    "erdosUrl": "https://erdosproblems.com/139",
    "erdosProblemStatus": "solved",
    "erdosPrizeValue": "$1000"
  },
  "overview": {
    "historicalContext": "Conjectured by Erdős and Turán in 1936, Szemerédi's theorem is one of the most celebrated results in combinatorics. Endre Szemerédi proved it in 1975 using a groundbreaking combinatorial approach. Furstenberg gave an ergodic theory proof in 1977. The $1000 prize from Erdős was awarded to Szemerédi. Modern quantitative bounds have been improved by Gowers (2001), Green-Tao (2017), and Kelley-Meka (2023).",
    "problemStatement": "Let r_k(N) be the size of the largest subset of {1,...,N} which does not contain a non-trivial k-term arithmetic progression. Prove that r_k(N) = o(N). Equivalently: any subset of integers with positive upper density contains arbitrarily long arithmetic progressions.",
    "proofStrategy": "The formalization defines k-AP-free sets and the r_k(N) function, then states Szemerédi's theorem in density formulation. For k=3 (Roth's theorem), we prove it using Mathlib's corners theorem chain: Regularity Lemma → Triangle Removal → Corners Theorem → Roth's Theorem. The general case k≥4 requires hypergraph regularity lemma (not yet in Mathlib) and is axiomatized.",
    "keyInsights": [
      "k=3 case (Roth's theorem) is fully proved in Mathlib via corners theorem",
      "Our IsKAPFree definition is equivalent to Mathlib's ThreeAPFree for k=3",
      "k≥4 requires hypergraph regularity lemma, not available in Mathlib",
      "Quantitative bounds: Kelley-Meka (2023) gives r₃(N) ≤ N·exp(-c(log N)^{1/12})",
      "Lower bound: Behrend (1946) shows r₃(N) ≥ N·exp(-c√(log N))"
    ]
  },
  "sections": [
    {
      "id": "definitions",
      "title": "Arithmetic Progression Definitions",
      "startLine": 35,
      "endLine": 56,
      "summary": "Core definitions for k-term arithmetic progressions and AP-free sets"
    },
    {
      "id": "main-theorem",
      "title": "Main Theorem Statement",
      "startLine": 58,
      "endLine": 92,
      "summary": "Erdős #139: r_k(N)/N → 0 as N → ∞"
    },
    {
      "id": "trivial-cases",
      "title": "Trivial Cases",
      "startLine": 94,
      "endLine": 127,
      "summary": "k=1 and k=2 cases proved directly"
    },
    {
      "id": "roth-theorem",
      "title": "Roth's Theorem (k=3)",
      "startLine": 128,
      "endLine": 186,
      "summary": "Connection to Mathlib's ThreeAPFree and proof via corners theorem"
    },
    {
      "id": "bounds",
      "title": "Quantitative Bounds",
      "startLine": 188,
      "endLine": 223,
      "summary": "Axiomatized bounds from Kelley-Meka, Gowers, and Behrend"
    }
  ],
  "conclusion": {
    "summary": "Szemerédi's theorem is one of the landmark results in combinatorics. Our formalization captures the density formulation and proves the equivalence between our definitions and Mathlib's for k=3. Roth's theorem (k=3) is fully proved using Mathlib's corners theorem chain. The general k≥4 case awaits hypergraph regularity formalization in Mathlib.",
    "implications": "This theorem has profound implications for additive combinatorics, ergodic theory, and theoretical computer science. It implies that pseudorandom sets must contain long arithmetic progressions, which has applications in PCP constructions and property testing.",
    "openQuestions": [
      "Formalize hypergraph regularity lemma for k≥4 proof",
      "Connect to Furstenberg's ergodic theory proof",
      "Formalize the Kelley-Meka quantitative bounds"
    ]
  }
}