{
  "id": "infinitude-primes",
  "title": "Infinitude of Prime Numbers",
  "slug": "infinitude-primes",
  "description": "Euclid's elegant proof that there are infinitely many prime numbers, formalized in Lean 4 with Mathlib.",
  "meta": {
    "author": "Euclid (formalized by Yannis Konstantoulas)",
    "sourceUrl": "https://github.com/ykonstant1/InfinitePrimes",
    "date": "~300 BCE",
    "status": "verified",
    "proofRepoPath": "Proofs/InfinitudePrimes.lean",
    "tags": ["number-theory", "primes", "classic", "euclid", "beginner-friendly"]
  },
  "overview": {
    "historicalContext": "Euclid's theorem on the infinitude of primes appears as Proposition 20 in Book IX of his Elements, written around 300 BCE in Alexandria. This makes it one of the oldest theorems with a proof that is still taught essentially unchanged today.\n\nThe result answered a question that must have puzzled ancient mathematicians: the primes 2, 3, 5, 7, 11, 13... seem to thin out as numbers grow larger. Do they eventually stop? Euclid showed definitively that they do not.\n\nWhat makes this proof remarkable is its method. Rather than trying to find large primes directly (which is computationally hard even today), Euclid showed that assuming finitely many primes leads to a contradiction. This proof by contradiction became a template for countless mathematical arguments.\n\nThe theorem launched two millennia of investigation into prime distribution, from Euler's proof that $\\sum 1/p$ diverges, to the Prime Number Theorem (1896), to the still-unsolved Riemann Hypothesis.",
    "problemStatement": "Theorem (Euclid, c. 300 BCE): There are infinitely many prime numbers.\n\nModern formulation: for any natural number $n$, there exists a prime $p$ with $p > n$:\n\n$$\\forall n \\in \\mathbb{N}, \\exists p \\text{ prime such that } p > n$$\n\nEquivalently: the sequence of primes $2, 3, 5, 7, 11, 13, 17, 19, 23, \\ldots$ never terminates.",
    "proofStrategy": "Euclid's proof is a masterpiece of mathematical economy:\n\n1. Given any $n$, construct $Q = n! + 1$ (one more than $n$ factorial)\n2. Observe that $Q \\geq 2$, so $Q$ has at least one prime divisor $p$\n3. Key claim: This prime $p$ must satisfy $p > n$\n4. Proof by contradiction: Suppose $p \\leq n$\n   - Then $p$ appears in the product $1 \\times 2 \\times \\cdots \\times n = n!$\n   - So $p$ divides $n!$\n   - But $p$ also divides $Q = n! + 1$\n   - Therefore $p$ divides $(n! + 1) - n! = 1$\n   - Contradiction: No integer $\\geq 2$ can divide 1\n5. Conclusion: Our assumption was wrong, so $p > n$ ✓\n\nNote: Euclid's original proof used the product of the first $n$ primes plus 1, not $n! + 1$. The factorial version is a modern simplification that avoids needing to enumerate primes.",
    "keyInsights": [
      "The factorial $n!$ is divisible by every positive integer from 1 to $n$—this is the engine of the proof",
      "Adding 1 to any multiple of $p$ gives a number that is NOT divisible by $p$ (it leaves remainder 1)",
      "The only positive divisor of 1 is 1 itself—no prime can divide 1",
      "We never need to identify which prime exceeds $n$—existence is enough"
    ]
  },
  "sections": [
    {
      "id": "key-lemmas",
      "title": "Key Lemmas",
      "startLine": 21,
      "endLine": 40,
      "summary": "Three supporting lemmas: dvd_factorial (any k ≤ n divides n!), factorial_succ_ge_two (n! + 1 ≥ 2), and dvd_of_dvd_add_one (if p divides both a and a+1, then p divides 1)."
    },
    {
      "id": "main-theorem",
      "title": "The Main Theorem",
      "startLine": 42,
      "endLine": 87,
      "summary": "Euclid's theorem: for any n, there exists a prime p > n. Constructs Q = n! + 1, finds its prime divisor p, and proves p > n by contradiction."
    },
    {
      "id": "corollaries",
      "title": "Corollaries",
      "startLine": 89,
      "endLine": 100,
      "summary": "Two corollaries: every prime has a larger prime (exists_prime_gt_prime), and there is no largest prime (no_largest_prime)."
    }
  ],
  "conclusion": {
    "summary": "This Lean formalization captures one of mathematics' most elegant arguments. The proof's power lies in its indirection: rather than constructing large primes (which is hard), we show that their non-existence leads to the absurdity of a prime dividing 1.\n\nThe construction $Q = n! + 1$ is ingenious. The factorial ensures that every 'small' prime divides $n!$, while the +1 shifts us to a number coprime to all of them. Whatever primes divide $Q$ must therefore be 'large'.\n\nThis formalization uses Mathlib's prime and factorial definitions, providing a clean and complete proof with no sorries.",
    "implications": "Euclid's theorem is the foundation for understanding prime distribution:\n\n1. Cryptographic Security — RSA, Diffie-Hellman, and elliptic curve cryptography all rely on the abundance of large primes. If primes were finite, modern encryption would be impossible.\n\n2. The Prime Number Theorem — Proved in 1896 by Hadamard and de la Vallée Poussin: the number of primes below $n$ is approximately $n/\\ln(n)$. Primes thin out, but never vanish.\n\n3. Prime Gaps — How far apart can consecutive primes be? Gaps grow, but there's always another prime ahead.\n\n4. Open Problems — The Twin Prime Conjecture (infinitely many $p$ with $p+2$ prime), Goldbach's Conjecture (every even $n > 2$ is a sum of two primes), and the Riemann Hypothesis all extend Euclid's question.",
    "openQuestions": [
      "Bertrand's Postulate: Is there always a prime between $n$ and $2n$? (Yes—proved by Chebyshev in 1852)",
      "How large can gaps between consecutive primes grow?",
      "Are there infinitely many Mersenne primes ($2^p - 1$)? Sophie Germain primes? Twin primes?"
    ]
  }
}
