{
  "id": "erdos-716",
  "title": "The Ruzsa-Szemerédi (6,3) Problem",
  "slug": "erdos-716",
  "description": "Let ℱ be the family of all 3-uniform hypergraphs with 6 vertices and 3 edges. Is ex₃(n, ℱ) = o(n²)? Equivalently, what is the maximum number of edges in a graph where every edge belongs to a unique triangle? Solved by Ruzsa-Szemerédi (1978).",
  "meta": {
    "author": "Ruzsa-Szemerédi",
    "sourceUrl": "https://erdosproblems.com/716",
    "date": "1978",
    "status": "complete",
    "proofRepoPath": "Proofs/Erdos716Problem.lean",
    "tags": [
      "erdos",
      "hypergraph-theory",
      "extremal-combinatorics",
      "regularity-lemma",
      "triangle-removal-lemma",
      "additive-combinatorics"
    ],
    "badge": "mathlib",
    "sorries": 0,
    "erdosNumber": 716,
    "erdosUrl": "https://erdosproblems.com/716",
    "erdosProblemStatus": "solved"
  },
  "overview": {
    "historicalContext": "This problem was conjectured by Brown, Erdős, and Sós in 1973 as part of their study of extremal hypergraph problems. The (6,3)-problem asks for the maximum number of edges in a 3-uniform hypergraph where no 6 vertices span 3 edges. Equivalently, in graph terms, it asks for the maximum edges in a graph where every edge belongs to exactly one triangle (a Ruzsa-Szemerédi graph).",
    "problemStatement": "Let ℱ be the family of all 3-uniform hypergraphs with 6 vertices and 3 edges. Is it true that ex₃(n, ℱ) = o(n²)? That is, is the extremal number subquadratic?",
    "proofStrategy": "Ruzsa and Szemerédi proved this using Szemerédi's regularity lemma. The key insight is the Triangle Removal Lemma: if a graph has few triangles (o(n³)), you can remove few edges (o(n²)) to make it triangle-free. For RS graphs, each triangle contributes a unique edge, giving the bound.",
    "keyInsights": [
      "The (6,3)-problem is equivalent to bounding edges in graphs where every edge belongs to a unique triangle",
      "The Triangle Removal Lemma follows from Szemerédi's regularity lemma",
      "The bounds are tight: ex₃(n; 6, 3) = n² · e^{±O(√log n)} using Behrend's construction",
      "This result implies Roth's theorem on 3-term arithmetic progressions",
      "The problem is a special case of the Brown-Erdős-Sós conjecture (now fully proved)"
    ]
  },
  "sections": [
    {
      "id": "hypergraph-basics",
      "title": "Hypergraph Definitions",
      "summary": "3-uniform hypergraphs, (v,e)-configurations, and the (6,3)-free condition",
      "startLine": 48,
      "endLine": 91
    },
    {
      "id": "graph-formulation",
      "title": "Graph Formulation",
      "summary": "RS graphs where every edge belongs to a unique triangle",
      "startLine": 115,
      "endLine": 142
    },
    {
      "id": "main-theorem",
      "title": "Ruzsa-Szemerédi Theorem",
      "summary": "Main result: ex₃(n; 6, 3) = o(n²)",
      "startLine": 144,
      "endLine": 212
    },
    {
      "id": "roth-connection",
      "title": "Connection to Arithmetic Progressions",
      "summary": "Link to Roth's theorem and Behrend's construction",
      "startLine": 214,
      "endLine": 261
    }
  ],
  "conclusion": {
    "summary": "Erdős Problem #716 was solved by Ruzsa and Szemerédi in 1978, proving that the maximum edges in a (6,3)-free 3-uniform hypergraph is subquadratic. The proof introduced the Triangle Removal Lemma, a fundamental tool in extremal graph theory.",
    "implications": "This result established deep connections between extremal combinatorics and additive number theory. It implies Roth's theorem and is a key case of the Brown-Erdős-Sós conjecture. The techniques influenced property testing and communication complexity.",
    "openQuestions": [
      "What is the exact asymptotic constant in ex₃(n; 6, 3)?",
      "Improve the bounds on the function between n²·e^{-c√log n} upper and lower bounds"
    ]
  }
}
