{
  "id": "erdos-280",
  "title": "Erdős Problem #280: Covering Congruences and Sieve Methods",
  "slug": "erdos-280",
  "description": "For sequences n₁ < n₂ < ⋯ with nₖ > (1+ε)k log k, count integers avoiding specified congruence classes. Erdős conjectured this count is Ω(k), but Cambie found a trivial counterexample.",
  "meta": {
    "author": "Erdős-Graham (1980), Cambie (counterexample)",
    "sourceUrl": "https://erdosproblems.com/280",
    "date": "1980",
    "status": "complete",
    "proofRepoPath": "Proofs/Erdos280Problem.lean",
    "tags": [
      "erdos",
      "number-theory",
      "covering-systems",
      "sieve-methods",
      "congruences",
      "disproved"
    ],
    "badge": "axiom",
    "sorries": 2,
    "erdosNumber": 280,
    "erdosUrl": "https://erdosproblems.com/280",
    "erdosProblemStatus": "solved"
  },
  "overview": {
    "historicalContext": "This problem appears in Erdős and Graham's 1980 monograph 'Old and New Problems and Results in Combinatorial Number Theory' (page 29). They noted that the problem 'may have to await improvements in current sieve methods.' However, the problem was resolved not by sophisticated sieve theory but by a simple counterexample.\n\nThe bound nₖ > (1+ε)k log k is best possible because the k-th prime is asymptotically k log k (by the Prime Number Theorem). Using primes as moduli would create a much more constrained problem.",
    "problemStatement": "Let $n_1 < n_2 < \\cdots$ be an infinite sequence of integers with associated residues $a_k \\pmod{n_k}$, such that for some $\\epsilon > 0$ we have $n_k > (1+\\epsilon)k \\log k$ for all $k$.\n\n**Original Conjecture (DISPROVED):**\n$$\\#\\{m < n_k : m \\not\\equiv a_i \\pmod{n_i} \\text{ for } 1 \\leq i \\leq k\\} \\neq o(k)$$\n\nIn other words, the count of integers less than $n_k$ avoiding all specified congruence classes should be $\\Omega(k)$.\n\n**Counterexample (Cambie):**\nTake $n_k = 2^k$ and $a_k = 2^{k-1} + 1$. Then only $m = 1$ avoids all classes, giving count = 1.",
    "proofStrategy": "We formalize the congruence class definitions, the counting function, and the original conjecture. Cambie's counterexample is constructed explicitly: nₖ = 2^k grows exponentially (satisfying the bound), and the residues aₖ = 2^(k-1) + 1 are chosen so that only m = 1 escapes all classes. The theorem original_conjecture_false establishes that the conjecture is disproved.",
    "keyInsights": [
      "The problem allowed too much freedom in choosing (nₖ, aₖ)",
      "Cambie's construction covers almost all integers with just k congruence classes",
      "The growth bound nₖ > (1+ε)k log k is optimal (matches prime growth)",
      "Adding constraints (coprimality, primality) may yield interesting variants",
      "Sieve methods were not needed - the counterexample is elementary"
    ]
  },
  "sections": [],
  "conclusion": {
    "summary": "Erdős Problem #280 asked whether integers avoiding specified congruence classes must be plentiful (Ω(k)). Cambie's trivial counterexample shows the answer is NO: by choosing nₖ = 2^k and appropriate residues, only m = 1 survives. The problem's formulation allowed too much flexibility.",
    "implications": "The resolution highlights that problems about covering congruences can have surprising counterexamples. More constrained variants (e.g., requiring coprime moduli) may remain interesting open problems.",
    "openQuestions": [
      "What happens if we require the moduli nₖ to be pairwise coprime?",
      "What if the moduli must be prime numbers?",
      "Are there natural conditions on (nₖ, aₖ) that restore the Ω(k) bound?",
      "What is the correct answer for the 'non-trivial' variant with coprimality?"
    ]
  }
}
