{
  "id": "erdos-71",
  "title": "Erdős Problem #71: Cycle Lengths in Arithmetic Progressions",
  "slug": "erdos-71",
  "description": "For every arithmetic progression P containing even numbers, does there exist c(P) such that graphs with average degree ≥ c contain a cycle of length in P? SOLVED by Bollobás (1977): YES.",
  "meta": {
    "author": "Erdős-Burr (conjecture), Bollobás (1977, proof)",
    "sourceUrl": "https://erdosproblems.com/71",
    "date": "1977",
    "status": "formalized",
    "proofRepoPath": "Proofs/Erdos71Problem.lean",
    "tags": [
      "erdos",
      "graph-theory",
      "cycle-lengths",
      "average-degree",
      "arithmetic-progressions"
    ],
    "badge": "axiom",
    "sorries": 0,
    "erdosNumber": 71,
    "erdosUrl": "https://erdosproblems.com/71",
    "erdosProblemStatus": "solved"
  },
  "overview": {
    "historicalContext": "Erdős and Burr conjectured that high average degree forces cycles from any arithmetic progression containing even numbers. Bollobás proved this in 1977. The even condition is necessary because bipartite graphs (with only even cycles) can have arbitrarily high average degree.",
    "problemStatement": "Let P = {a, a+d, a+2d, ...} be an arithmetic progression containing even numbers. Does there exist c(P) > 0 such that every graph with average degree ≥ c contains a cycle whose length is in P? Answer: YES (Bollobás 1977).",
    "proofStrategy": "The formalization defines arithmetic progressions, the containsEven condition, cycle containment, and average degree. Two corollaries are verified: (1) high degree implies an even cycle, (2) high degree implies a cycle of length divisible by 4. The necessity of the even condition is shown via bipartite graphs.",
    "keyInsights": [
      "P contains even numbers iff (a is even) OR (d is odd)",
      "Bollobás (1977): c(P) exists for all valid progressions",
      "Even condition is NECESSARY: bipartite K_{n,n} has high degree but only even cycles",
      "Two verified corollaries: even cycles, multiples of 4",
      "OPEN: optimal dependence of c(P) on parameters a, d",
      "Related: Bondy-Simonovits theorem on cycle lengths"
    ]
  },
  "sections": [],
  "conclusion": {
    "summary": "Erdős Problem #71 is SOLVED (Bollobás 1977). High average degree forces cycles from any arithmetic progression containing even numbers. The formalization includes two verified corollaries and proves the even condition is necessary via bipartite counterexamples.",
    "implications": "This connects graph density to cycle structure in a precise way. The result is fundamental in extremal graph theory and relates to Turán-type problems about cycles.",
    "openQuestions": [
      "What is the optimal dependence c(P) = f(a, d)?",
      "Can Bollobás's proof be made constructive?",
      "What about weighted or directed versions?",
      "How does the constant change for specific families of graphs?"
    ]
  }
}
