{
  "id": "primitive-roots",
  "title": "Primitive Roots Modulo Primes",
  "slug": "primitive-roots",
  "description": "For any prime p, there are exactly φ(p-1) primitive roots modulo p. Uses the cyclic structure of (ℤ/pℤ)* and Mathlib's counting theorem.",
  "meta": {
    "author": "Euler/Gauss (formalized via Mathlib)",
    "date": "1773/1801",
    "status": "verified",
    "proofRepoPath": "Proofs/PrimitiveRoots.lean",
    "tags": [
      "number-theory",
      "group-theory",
      "cyclic-groups",
      "cryptography",
      "classical"
    ],
    "badge": "mathlib",
    "sorries": 0,
    "mathlibDependencies": [
      {
        "theorem": "isCyclic_of_subgroup_isDomain",
        "description": "Finite subgroups of units in integral domains are cyclic",
        "module": "Mathlib.RingTheory.IntegralDomain"
      },
      {
        "theorem": "IsCyclic.card_orderOf_eq_totient",
        "description": "In a cyclic group of order n, there are φ(d) elements of order d",
        "module": "Mathlib.GroupTheory.SpecificGroups.Cyclic"
      },
      {
        "theorem": "Nat.totient",
        "description": "Euler's totient function",
        "module": "Mathlib.Data.Nat.Totient"
      },
      {
        "theorem": "ZMod.card_units_eq_totient",
        "description": "The order of (ℤ/nℤ)* equals φ(n)",
        "module": "Mathlib.Data.ZMod.Basic"
      }
    ],
    "originalContributions": [
      "Clean proof that (ℤ/pℤ)* is cyclic via integral domain theorem",
      "Direct application of cyclic group counting to primitive roots",
      "Characterization of primitive roots as generators",
      "Pedagogical examples for p = 2, 3, 5, 7, 11, 13"
    ],
    "dateAdded": "12/31/25"
  },
  "overview": {
    "historicalContext": "The theory of primitive roots has a rich history spanning three centuries. Euler (1773) first proved that primitive roots exist modulo any prime p, establishing that the multiplicative group (ℤ/pℤ)* is cyclic. Gauss, in his *Disquisitiones Arithmeticae* (1801), gave a complete characterization: primitive roots exist modulo n if and only if n = 1, 2, 4, p^k, or 2p^k for odd prime p.\n\nThe count φ(p-1) follows from the structure theory of cyclic groups, which was fully developed in the 19th century. Today, primitive roots are fundamental in cryptography—the security of Diffie-Hellman key exchange and many other protocols depends on the difficulty of computing discrete logarithms in groups generated by primitive roots.",
    "problemStatement": "**Theorem (Euler, 1773)**: For any prime p, the multiplicative group (ℤ/pℤ)* is cyclic of order p-1.\n\n**Corollary**: There are exactly φ(p-1) primitive roots modulo p, where φ is Euler's totient function.\n\nA **primitive root** g modulo p is an element whose powers g, g², g³, ..., g^(p-1) give all p-1 non-zero residues modulo p. Equivalently, g generates the entire group (ℤ/pℤ)*.",
    "proofStrategy": "The proof elegantly combines two powerful results:\n\n1. **Cyclic Structure**: ZMod p is a field (for prime p), hence an integral domain. Mathlib's theorem `isCyclic_of_subgroup_isDomain` tells us that any finite subgroup of units in an integral domain is cyclic. Therefore (ℤ/pℤ)* is cyclic.\n\n2. **Counting by Order**: In any cyclic group of order n, there are exactly φ(d) elements of order d for each divisor d of n. This is `IsCyclic.card_orderOf_eq_totient` in Mathlib.\n\n3. **Application**: Primitive roots are elements of order p-1 in a cyclic group of order p-1. By the counting theorem, there are exactly φ(p-1) such elements.\n\nThe proof is essentially a two-line application of these deep structural results!",
    "keyInsights": [
      "The multiplicative group (ℤ/pℤ)* is cyclic because ZMod p is a field—this is the key structural fact",
      "Primitive roots = generators = elements of maximal order",
      "The formula ∑_{d|n} φ(d) = n partitions a cyclic group by element orders",
      "φ(p-1) can be computed from the prime factorization of p-1"
    ]
  },
  "sections": [
    {
      "id": "setup",
      "title": "Definitions and Setup",
      "startLine": 55,
      "endLine": 72,
      "summary": "Define IsPrimitiveRoot as having order equal to |G|, and prove it's equivalent to having order p-1."
    },
    {
      "id": "cyclic",
      "title": "The Multiplicative Group is Cyclic",
      "startLine": 73,
      "endLine": 87,
      "summary": "Prove (ℤ/pℤ)* is cyclic using the integral domain theorem, and that its order is p-1."
    },
    {
      "id": "existence",
      "title": "Existence of Primitive Roots",
      "startLine": 88,
      "endLine": 98,
      "summary": "Since cyclic groups have generators, primitive roots exist."
    },
    {
      "id": "counting",
      "title": "Counting Primitive Roots",
      "startLine": 99,
      "endLine": 131,
      "summary": "The main theorem: there are exactly φ(p-1) primitive roots, using the cyclic group counting theorem."
    },
    {
      "id": "examples",
      "title": "Examples",
      "startLine": 132,
      "endLine": 155,
      "summary": "Concrete examples: φ(1)=1, φ(2)=1, φ(4)=2, φ(6)=2, φ(10)=4, φ(12)=4."
    },
    {
      "id": "generators",
      "title": "Connection to Group Theory",
      "startLine": 156,
      "endLine": 178,
      "summary": "Prove that primitive roots are exactly the generators of (ℤ/pℤ)*."
    }
  ],
  "conclusion": {
    "summary": "This formalization demonstrates the power of structural group theory. Rather than analyzing primitive roots combinatorially, we leverage two deep facts: (1) finite unit groups in integral domains are cyclic, and (2) cyclic groups have predictable element counts by order. The main theorem follows in essentially two lines!\n\nThe proof showcases how modern formalization can capture classical results cleanly. Euler and Gauss developed these ideas over decades; we verify them in a few lines of Lean by standing on Mathlib's shoulders.",
    "implications": "**Cryptographic Applications**\n\n1. **Discrete Logarithms**: If g is a primitive root mod p, every non-zero a mod p can be written as a ≡ g^k for unique k. Computing k from a is the discrete log problem—believed to be hard.\n\n2. **Diffie-Hellman**: Public-key cryptography often uses primitive roots. Alice and Bob share g^ab mod p without revealing a or b, because discrete logs are hard to compute.\n\n3. **Digital Signatures**: DSA and related schemes use primitive roots in their construction.\n\n**Number-Theoretic Applications**\n\n1. **Quadratic Residues**: An element a is a quadratic residue mod p iff its discrete log (base g) is even.\n\n2. **Artin's Conjecture**: Is 2 a primitive root mod p for infinitely many primes p? (Still open!)\n\n3. **Index Calculus**: Modern algorithms for discrete logs exploit primitive root structure.",
    "openQuestions": [
      "Artin's Primitive Root Conjecture: For any non-square integer a ≠ -1, is a a primitive root mod p for infinitely many primes p?",
      "How can we efficiently find a primitive root mod p? (No polynomial-time algorithm is known for general p)",
      "What is the smallest primitive root mod p? (Conjectured to be O(p^ε) for any ε > 0)"
    ]
  }
}
