{
  "id": "erdos-65",
  "title": "Erdős Problem #65: Cycle Lengths in Dense Graphs",
  "slug": "erdos-65",
  "description": "Let G be a graph with n vertices and kn edges. Is the sum of reciprocals of cycle lengths Σ 1/aᵢ ≫ log k? Is this sum minimized when G is complete bipartite?",
  "meta": {
    "author": "Erdős & Hajnal",
    "sourceUrl": "https://erdosproblems.com/65",
    "date": "",
    "status": "formalized",
    "proofRepoPath": "Proofs/Erdos65Problem.lean",
    "tags": [
      "erdos",
      "graph-theory",
      "extremal-combinatorics",
      "cycles"
    ],
    "badge": "axiom",
    "sorries": 0,
    "erdosNumber": 65,
    "erdosUrl": "https://erdosproblems.com/65",
    "erdosProblemStatus": "solved"
  },
  "overview": {
    "historicalContext": "A problem of Erdős and Hajnal connecting edge density to cycle structure. Gyárfás, Komlós, and Szemerédi proved the logarithmic bound in 1984. Liu and Montgomery proved the sharp constant (1/2 - o(1)) in 2020.",
    "problemStatement": "Let G be a graph with n vertices and kn edges, and let a₁ < a₂ < ... be the distinct cycle lengths in G. Is Σ 1/aᵢ ≫ log k? Is this sum minimized when G is a complete bipartite graph?",
    "proofStrategy": "The formalization defines cycle detection predicates, edge density, and the reciprocal sum. The GKS theorem is stated as an axiom. The open minimization question is formalized as Erdos65Question. Related results include the Kővári-Sós-Turán theorem.",
    "keyInsights": [
      "Dense graphs must have diverse cycle lengths - proved by GKS (1984)",
      "Complete bipartite graphs have only even cycles {4, 6, 8, ...}",
      "The minimization question (whether K_{r,s} is optimal) remains open",
      "Connection to Zarankiewicz problem via forbidden subgraph techniques"
    ]
  },
  "sections": [],
  "conclusion": {
    "summary": "Erdős Problem #65 is PARTIALLY SOLVED. The logarithmic lower bound Σ 1/aᵢ ≫ log k was proved by Gyárfás-Komlós-Szemerédi (1984), with sharp constant by Liu-Montgomery (2020). The minimization question remains open.",
    "implications": "Establishes fundamental connection between edge density and cycle variety in extremal graph theory.",
    "openQuestions": [
      "Is the reciprocal sum minimized by complete bipartite graphs among all graphs with the same edge count?"
    ]
  }
}