{
  "id": "bounded-prime-gaps",
  "name": "Bounded Prime Gaps (Zhang/Polymath)",
  "description": "Prove Zhang's theorem: there exists H such that infinitely many consecutive primes differ by at most H. Zhang showed H ≤ 70,000,000; Polymath improved to H ≤ 246.",
  "erdosNumber": null,
  "source": "Zhang 2013, Polymath8 2014",
  "status": "blocked",
  "knowledge": {
    "insights": [
      "Proof requires Selberg sieve, GPY sieve methodology - neither formalized in any theorem prover",
      "Bombieri-Vinogradov theorem (equidistribution of primes in APs) not in Mathlib - critical dependency",
      "Kloosterman sums and exponential sum bounds needed - requires Weil conjectures machinery",
      "Mathlib HAS: Dirichlet characters, L-functions, von Mangoldt function, prime counting, Dirichlet's theorem",
      "Repository axiomatizes Zhang's result in Erdos5PrimeGaps.lean but cannot prove it",
      "Zhang's proof is 50+ pages of dense analytic number theory combining multiple techniques",
      "Polymath8 involved dozens of mathematicians coordinating to optimize constants",
      "2026-01-19 CONFIRMED: Selberg sieve and Bombieri-Vinogradov NOT in Mathlib",
      "2026-01-19: Zulip discussions show sieve methods are a future goal, not completed",
      "2026-01-19: Bhavik Mehta formalized Eratosthenes-Legendre sieve for unit fractions",
      "2026-01-19: Maynard sieve interest for infinite partial sumsets in primes",
      "2026-01-19: Erdos5PrimeGaps.lean has zhang_bounded_gaps axiom + 4 other axioms",
      "2026-01-19: Vaughans identity needed before B-V can be formalized"
    ],
    "builtItems": [
      "zhang_bounded_gaps axiom in Erdos5PrimeGaps.lean",
      "Normalized gap limit point theorem (consequence of axiom)"
    ],
    "mathlibGaps": [
      "Selberg sieve (foundational, 1940s technique)",
      "GPY sieve (Goldston-Pintz-Yildirim 2005)",
      "Bombieri-Vinogradov theorem",
      "Kloosterman sum bounds",
      "Exponential sum theory with explicit constants",
      "Sieve weights and admissible k-tuple machinery"
    ],
    "nextSteps": [
      "Accept zhang_bounded_gaps as axiom (current approach - correct)",
      "Monitor Mathlib for Selberg sieve developments",
      "Consider contributing Eratosthenes-Legendre sieve (simpler, in progress elsewhere)",
      "Vaughans identity formalization as prerequisite milestone"
    ],
    "progressSummary": "CONFIRMED BLOCKED (2026-01-19): Sieve theory infrastructure remains absent from Mathlib. Zulip discussions show active interest but no completed formalizations. Current axiom-based approach is correct. Estimated 2+ years for infrastructure."
  },
  "lastUpdated": "2026-01-19",
  "claimedBy": null
}
