{
  "id": "erdos-701",
  "title": "Chvátal's Conjecture on Intersecting Families",
  "slug": "erdos-701",
  "description": "Let F be a hereditary family. There exists x such that every intersecting subfamily F' has |F'| ≤ |{A ∈ F : x ∈ A}|. Status: OPEN with partial results.",
  "meta": {
    "author": "Chvátal",
    "sourceUrl": "https://erdosproblems.com/701",
    "date": "1974",
    "status": "complete",
    "proofRepoPath": "Proofs/Erdos701Problem.lean",
    "tags": [
      "erdos",
      "combinatorics",
      "intersecting-families",
      "extremal-set-theory"
    ],
    "badge": "axiom",
    "sorries": 0,
    "erdosNumber": 701,
    "erdosUrl": "https://erdosproblems.com/701",
    "erdosProblemStatus": "open"
  },
  "overview": {
    "historicalContext": "Chvátal's conjecture (1974) generalizes the Erdős-Ko-Rado theorem to hereditary families. The conjecture asserts that the maximum intersecting subfamily is always a 'star' - all sets containing a fixed element. Despite nearly 50 years of research, the general case remains open. Partial results exist for injection-based orderings (Chvátal 1974), Sterboul conditions (1974), covering number 2 (Frankl-Kupavskii 2023), and weighted versions (Borg 2011).",
    "problemStatement": "Let F be a family of sets closed under taking subsets (hereditary). There exists an element x such that for any intersecting subfamily F' ⊆ F: |F'| ≤ |{A ∈ F : x ∈ A}|.",
    "proofStrategy": "The formalization defines hereditary families, intersecting families, and stars. The main conjecture is axiomatized as open. Partial results (Sterboul conditions, covering number 2) are stated as separate axioms. The connection to Erdős-Ko-Rado is explored, showing how uniform families are NOT hereditary (explaining why EKR is not a direct special case).",
    "keyInsights": [
      "Hereditary = closed under subsets (also called downsets or ideals)",
      "Stars (sets containing x) are always intersecting subfamilies",
      "The conjecture says some star is MAXIMAL among all intersecting subfamilies",
      "The difficulty is finding a single x that works for ALL intersecting subfamilies",
      "Uniform k-families are not hereditary, so EKR doesn't directly apply"
    ]
  },
  "sections": [
    {
      "id": "hereditary",
      "startLine": 42,
      "endLine": 71,
      "summary": "Definitions of hereditary families with examples (power set, bounded cardinality)."
    },
    {
      "id": "intersecting",
      "startLine": 72,
      "endLine": 99,
      "summary": "Definitions of intersecting families with examples (empty, singleton)."
    },
    {
      "id": "stars",
      "startLine": 100,
      "endLine": 129,
      "summary": "Definition of stars and proofs that stars are intersecting and are subfamilies."
    },
    {
      "id": "conjecture",
      "startLine": 130,
      "endLine": 151,
      "summary": "Statement of Chvátal's conjecture as a definition and axiom recording its open status."
    },
    {
      "id": "partial",
      "startLine": 152,
      "endLine": 217,
      "summary": "Partial results: Sterboul conditions, Frankl-Kupavskii (covering number 2), Borg's weighted version."
    },
    {
      "id": "ekr",
      "startLine": 218,
      "endLine": 258,
      "summary": "Connection to Erdős-Ko-Rado; proof that uniform families are not hereditary."
    }
  ],
  "conclusion": {
    "summary": "Erdős Problem #701 (Chvátal's Conjecture) remains OPEN. The conjecture asserts that for hereditary families, the maximum intersecting subfamily is a star. Partial results exist for special cases but the general conjecture is unresolved.",
    "implications": "A resolution would unify and extend classical results in extremal set theory. The conjecture connects hereditary families (independence systems, matroids) with intersection properties.",
    "openQuestions": [
      "Does the conjecture hold for all hereditary families?",
      "What structural properties of F determine which element x achieves the maximum star?",
      "Can the weighted generalization (Borg) be fully resolved?",
      "Are there counterexamples for families with high covering number?"
    ]
  }
}
