{
  "id": "fundamental-theorem-calculus",
  "title": "Fundamental Theorem of Calculus",
  "slug": "fundamental-theorem-calculus",
  "description": "The profound connection between differentiation and integration: Newton and Leibniz's crowning achievement that unified the two pillars of calculus into a single coherent theory.",
  "meta": {
    "author": "Newton & Leibniz (1680s), Cauchy (1820s)",
    "date": "1680s",
    "status": "verified",
    "tags": ["analysis", "calculus", "integration", "differentiation", "classic", "intermediate"],
    "proofRepoPath": "Proofs/FundamentalTheoremCalculus.lean"
  },
  "overview": {
    "historicalContext": "The Fundamental Theorem of Calculus (FTC) represents one of mathematics' greatest unifications. Isaac Newton and Gottfried Leibniz independently discovered it in the 1680s, though their bitter priority dispute would rage for decades.\n\nNewton developed his 'method of fluxions' while avoiding the plague at Woolsthorpe Manor (1665-1666), but published much later. Leibniz independently created his differential calculus in the 1670s, with superior notation that we still use today (dx, dy, ∫).\n\nWhile Newton and Leibniz grasped the theorem intuitively, rigorous proof required the epsilon-delta foundations developed by Cauchy (1821) and perfected by Weierstrass (1860s). The theorem connects area (integration) with slope (differentiation) - two concepts that appear completely unrelated until FTC reveals their deep connection.",
    "problemStatement": "The Fundamental Theorem of Calculus has two parts:\n\nPart 1 (Differentiation of Integrals):\nIf $f$ is continuous on $[a, b]$ and we define\n$$F(x) = \\int_a^x f(t)\\,dt$$\nthen $F$ is differentiable and $F'(x) = f(x)$.\n\nPart 2 (Evaluation of Integrals):\nIf $F$ is an antiderivative of $f$ on $[a, b]$ (meaning $F' = f$), then\n$$\\int_a^b f(x)\\,dx = F(b) - F(a)$$\n\nTogether, these say that differentiation and integration are inverse operations.",
    "proofStrategy": "Part 1 Strategy:\n\n1. Consider the difference quotient of $F$:\n   $$\\frac{F(x+h) - F(x)}{h} = \\frac{1}{h}\\int_x^{x+h} f(t)\\,dt$$\n\n2. By the Mean Value Theorem for integrals, this equals $f(c)$ for some $c$ between $x$ and $x+h$\n\n3. As $h \\to 0$, we have $c \\to x$, and by continuity of $f$, $f(c) \\to f(x)$\n\n4. Therefore $F'(x) = \\lim_{h \\to 0} \\frac{F(x+h) - F(x)}{h} = f(x)$\n\nPart 2 Strategy:\n\n1. Define $G(x) = \\int_a^x f(t)\\,dt$\n\n2. By Part 1, $G'(x) = f(x) = F'(x)$\n\n3. Since $G' = F'$, we have $(F - G)' = 0$, so $F - G = C$ (constant)\n\n4. At $x = a$: $G(a) = 0$, so $C = F(a)$, meaning $G(x) = F(x) - F(a)$\n\n5. At $x = b$: $\\int_a^b f = G(b) = F(b) - F(a)$",
    "keyInsights": [
      "Integration and differentiation are inverse operations, not just computational tricks",
      "The integral ∫ₐˣ f(t)dt defines a function whose derivative is f - integration 'builds' an antiderivative",
      "FTC Part 2 is why we seek antiderivatives: it converts integration into mere evaluation",
      "Antiderivatives are unique up to a constant, which is why indefinite integrals have '+C'",
      "The theorem requires continuity; discontinuous functions require the Lebesgue integral"
    ]
  },
  "sections": [
    {
      "id": "setup",
      "title": "Setup and Imports",
      "startLine": 1,
      "endLine": 29,
      "summary": "Introduces the historical context, imports Mathlib's calculus and integration libraries, and opens the namespace."
    },
    {
      "id": "integral-function",
      "title": "The Integral Function",
      "startLine": 31,
      "endLine": 42,
      "summary": "Defines F(x) = ∫ₐˣ f(t)dt, the cumulative integral that measures accumulated area."
    },
    {
      "id": "ftc-part1",
      "title": "FTC Part 1: Differentiation of Integrals",
      "startLine": 44,
      "endLine": 59,
      "summary": "Proves that the derivative of an integral recovers the original function: F'(x) = f(x)."
    },
    {
      "id": "ftc-part2",
      "title": "FTC Part 2: Evaluation of Integrals",
      "startLine": 61,
      "endLine": 86,
      "summary": "Proves that the integral of a derivative equals the net change: ∫ₐᵇ F' = F(b) - F(a)."
    },
    {
      "id": "antiderivatives",
      "title": "Antiderivatives and Uniqueness",
      "startLine": 88,
      "endLine": 139,
      "summary": "Shows that the integral function is an antiderivative, and that antiderivatives differ only by constants."
    },
    {
      "id": "checks",
      "title": "Type Checking",
      "startLine": 141,
      "endLine": 146,
      "summary": "Verifies the types of the main theorems using #check commands."
    }
  ],
  "conclusion": {
    "summary": "The Fundamental Theorem of Calculus is the cornerstone of mathematical analysis. It reveals that the two main operations of calculus - finding slopes (differentiation) and finding areas (integration) - are not merely related but are precise inverses of each other.\n\nThis insight transforms integration from an intractable geometric problem into a mechanical process: to find ∫ₐᵇ f, simply find any function F with F' = f, then compute F(b) - F(a). Every integration technique (substitution, parts, partial fractions) is just a method for finding antiderivatives.\n\nThe formalization demonstrates how naturally these classical results translate to modern type theory. Lean's dependent types capture the subtle conditions (continuity, integrability) that make FTC valid.",
    "implications": "The FTC has profound implications across mathematics and physics:\n\n1. Computational Power - Reduces integration (infinitely many additions) to evaluation (one subtraction)\n\n2. Physics - Connects instantaneous rate (velocity) to accumulated quantity (distance); relates force to work done\n\n3. The '+C' Mystery Resolved - Antiderivatives are unique only up to constants; FTC Part 2 uses the difference F(b) - F(a), canceling any constant\n\n4. Existence of Antiderivatives - Every continuous function has an antiderivative (the integral function), even if we can't write it in closed form\n\n5. Foundation for Differential Equations - Solving y' = f is equivalent to finding antiderivatives; FTC provides existence guarantees\n\n6. Generalization - Leads to Stokes' theorem, the divergence theorem, and the entire theory of differential forms",
    "openQuestions": [
      "How does FTC generalize to the Lebesgue integral for discontinuous functions?",
      "What is the relationship between FTC and Stokes' theorem in differential geometry?",
      "Can FTC be formulated for functions of multiple variables without differential forms?"
    ]
  }
}
