{
  "id": "erdos-120",
  "title": "Erdős Problem #120: The Similarity Problem",
  "slug": "erdos-120",
  "description": "For every infinite A ⊆ ℝ, must there exist a set E of positive measure containing no similar copy of A?",
  "meta": {
    "author": "Erdős",
    "sourceUrl": "https://erdosproblems.com/120",
    "status": "formalized",
    "proofRepoPath": "Proofs/Erdos120Problem.lean",
    "tags": ["measure theory", "similarity", "combinatorics"],
    "badge": "open-problem",
    "sorries": 6,
    "erdosNumber": 120,
    "erdosUrl": "https://erdosproblems.com/120",
    "erdosProblemStatus": "open",
    "mathlibDependencies": []
  },
  "overview": {
    "historicalContext": "The Similarity Problem asks whether infinite sets are 'avoidable' by positive measure sets. Steinhaus (1920) showed finite sets are universal: every positive measure set contains a similar copy. The conjecture is that infinite sets behave differently. A $100 prize is offered. Svetic (2000) surveyed the problem; Jung, Lai, and Mooroogen (2024) provided recent progress.",
    "problemStatement": "Given an infinite set A ⊆ ℝ, must there exist a set E ⊆ ℝ of positive measure containing no translated and scaled copy of A (no set of the form aA + b where a ≠ 0)?",
    "proofStrategy": "The problem splits into cases. Unbounded sets and sets dense in intervals are known to be avoidable. The hard cases are bounded, nowhere-dense infinite sets like convergent sequences. The geometric sequence {1, 1/2, 1/4, ...} is a key test case.",
    "keyInsights": [
      "A similar copy of A is aA + b = {a·x + b : x ∈ A} for a ≠ 0",
      "Steinhaus: Finite sets are universal (every positive measure set contains a copy)",
      "Unbounded sets and sets dense in intervals are avoidable",
      "The geometric sequence {1, 1/2, 1/4, ...} is the key open case",
      "Measure-theoretic tools (density theorem, Steinhaus) are central"
    ]
  },
  "sections": [
    {
      "id": "section-definition",
      "title": "Similar Copies",
      "content": "A similar copy of A is any set {a·x + b : x ∈ A} where a ≠ 0. This is a translate and scale of A. The question asks whether positive measure sets can avoid all such copies."
    },
    {
      "id": "section-steinhaus",
      "title": "Steinhaus Theorem",
      "content": "For finite sets A, every set E of positive measure contains a similar copy of A. This is because E - E contains an interval around 0 (by Steinhaus), and finite patterns can be embedded using this structure."
    },
    {
      "id": "section-known",
      "title": "Known Cases",
      "content": "Unbounded sets are avoidable: we can build E avoiding large-scale patterns. Sets dense in an interval are also avoidable. The hard cases are bounded, nowhere-dense sets like convergent sequences."
    },
    {
      "id": "section-geometric",
      "title": "Geometric Sequence",
      "content": "The case A = {1, 1/2, 1/4, ...} is Problem 94 on Ben Green's list. It exemplifies the difficulty: the sequence is bounded, converges to 0, and has specific ratio structure that must be avoided."
    },
    {
      "id": "section-approaches",
      "title": "Approaches",
      "content": "Constructive approaches try to build E by excluding similar copies iteratively. Probabilistic methods consider random constructions. Fourier analysis might exploit the spectral structure of A."
    }
  ],
  "conclusion": {
    "summary": "Erdős Problem #120 (The Similarity Problem) asks whether every infinite set is avoidable by some positive measure set. Finite sets are universal (Steinhaus), but infinite sets are conjectured to be avoidable. The geometric sequence case remains open.",
    "implications": "Resolution would illuminate the interplay between measure theory and combinatorial structure. It connects to Ramsey theory and the fine structure of the real line.",
    "openQuestions": [
      "Is the geometric sequence {1, 1/2, 1/4, ...} avoidable?",
      "Is every countable convergent sequence avoidable?",
      "What is the minimum measure of a set avoiding all similar copies?",
      "Can avoiding sets be chosen with nice structure (e.g., union of intervals)?"
    ]
  }
}
