{
  "id": "erdos-120",
  "title": "Erdős Problem #120: The Similarity Problem",
  "slug": "erdos-120",
  "description": "For every infinite A ⊆ ℝ, must there exist a set E of positive Lebesgue measure containing no similar copy aA + b (a ≠ 0)?",
  "meta": {
    "author": "Erdős",
    "sourceUrl": "https://erdosproblems.com/120",
    "status": "formalized",
    "proofRepoPath": "Proofs/Erdos120Problem.lean",
    "tags": ["measure theory", "similarity", "real analysis", "geometric measure theory"],
    "badge": "axiom",
    "sorries": 0,
    "erdosNumber": 120,
    "erdosUrl": "https://erdosproblems.com/120",
    "erdosProblemStatus": "open"
  },
  "overview": {
    "historicalContext": "The Similarity Problem asks whether infinite sets are 'avoidable' — whether positive-measure sets can be constructed that contain no translated-scaled copy. Steinhaus (1920) showed finite sets are universal: every positive-measure set contains a similar copy of any finite set.\n\nErdős conjectured that infinite sets behave fundamentally differently and offered a $100 prize. Unbounded sets and sets dense in intervals are known to be avoidable. The hard case is bounded, nowhere-dense infinite sets, with the geometric sequence {1, 1/2, 1/4, ...} as the key test case (also Problem 94 on Ben Green's list).\n\nSvetic (2000) surveyed the problem comprehensively. Jung, Lai, and Mooroogen (2024) provided recent progress. The problem connects measure theory, Ramsey-type combinatorics, and the fine structure of the real line.",
    "problemStatement": "Given an infinite set A ⊆ ℝ, must there exist a set E ⊆ ℝ of positive Lebesgue measure containing no similar copy of A (no set of the form aA + b with a ≠ 0)?",
    "proofStrategy": "The formalization defines similar copies, containment, avoidance, and universality. Steinhaus's result for finite sets and known avoidable cases are axioms. The conjecture is stated with an equivalent reformulation (no infinite set is universal). Two proved theorems demonstrate ratio preservation and the universal/avoidable duality. The geometric sequence is defined as the key test case.",
    "keyInsights": [
      "A similar copy of A is aA + b = {a·x + b : x ∈ A} for a ≠ 0; ratios of differences are preserved",
      "Steinhaus (1920): finite sets are universal — every positive-measure set contains a similar copy",
      "Unbounded sets and interval-dense sets are avoidable; the hard case is bounded nowhere-dense sets",
      "The geometric sequence {1, 1/2, 1/4, ...} is the key test case (Ben Green's Problem 94)",
      "The Steinhaus difference theorem and Lebesgue density theorem are the main analytical tools"
    ]
  },
  "sections": [
    {
      "id": "similar-copies",
      "title": "Part 1: Similar Copies",
      "startLine": 38,
      "endLine": 69,
      "summary": "Definition of similar copy aA+b, containment, and avoidance predicates."
    },
    {
      "id": "universal-sets",
      "title": "Part 2: Universal Similarity Sets",
      "startLine": 71,
      "endLine": 96,
      "summary": "Universal similarity sets (every positive-measure set contains a copy) and avoidable sets."
    },
    {
      "id": "steinhaus",
      "title": "Part 3: Steinhaus Theorem",
      "startLine": 98,
      "endLine": 116,
      "summary": "Steinhaus (1920): finite nonempty sets are universal similarity sets."
    },
    {
      "id": "known-cases",
      "title": "Part 4: Known Avoidable Cases",
      "startLine": 118,
      "endLine": 143,
      "summary": "Unbounded sets and interval-dense sets are avoidable."
    },
    {
      "id": "conjecture",
      "title": "Part 5: The Erdős Conjecture",
      "startLine": 145,
      "endLine": 172,
      "summary": "The main conjecture: every infinite set is avoidable. Plus the negation."
    },
    {
      "id": "geometric",
      "title": "Part 6: The Geometric Sequence Case",
      "startLine": 174,
      "endLine": 203,
      "summary": "The geometric sequence {(1/2)^n}, its properties, and the open question of avoidability."
    },
    {
      "id": "ratio-invariance",
      "title": "Part 7: Ratio Invariance",
      "startLine": 205,
      "endLine": 227,
      "summary": "Proved theorem: similar copies preserve ratios of differences via ring_nf."
    },
    {
      "id": "measure-tools",
      "title": "Part 8: Measure-Theoretic Tools",
      "startLine": 229,
      "endLine": 255,
      "summary": "Steinhaus difference theorem and Lebesgue density theorem as analytical tools."
    },
    {
      "id": "connections",
      "title": "Part 9: Connections and Related Problems",
      "startLine": 257,
      "endLine": 294,
      "summary": "Proved: universal ↔ ¬avoidable. Proved: conjecture ↔ no infinite set is universal."
    },
    {
      "id": "summary",
      "title": "Part 10: Summary",
      "startLine": 296,
      "endLine": 331,
      "summary": "Known results theorem: finite=universal ∧ unbounded=avoidable. Status: OPEN ($100)."
    }
  ],
  "conclusion": {
    "summary": "Erdős Problem #120 (The Similarity Problem) asks whether every infinite set A ⊆ ℝ is avoidable by some positive-measure set. Steinhaus showed finite sets are universal, but Erdős conjectured all infinite sets are avoidable. The geometric sequence case remains the key open test. $100 prize offered.",
    "implications": "Resolution would illuminate the boundary between finite combinatorial universality (Steinhaus) and infinite set avoidability, connecting measure theory, Ramsey theory, and the fine structure of the real line.",
    "openQuestions": [
      "Is the geometric sequence {1, 1/2, 1/4, ...} avoidable?",
      "Is every countable convergent sequence avoidable?",
      "What is the minimum measure of a set avoiding all similar copies?",
      "Can avoiding sets be chosen with nice structure (e.g., union of intervals)?"
    ]
  }
}
