{
  "id": "erdos-338",
  "title": "Erdős Problem #338: Restricted Order of Additive Bases",
  "slug": "erdos-338",
  "description": "What are the necessary and sufficient conditions for an additive basis to have a restricted order? Can the restricted order be bounded in terms of the order? When does restricted order equal order?",
  "meta": {
    "author": "Kelly, Hennecart, Hegyvári, Plagne",
    "sourceUrl": "https://erdosproblems.com/338",
    "date": "1957-2007",
    "status": "formalized",
    "proofRepoPath": "Proofs/Erdos338Problem.lean",
    "tags": [
      "erdos",
      "number-theory",
      "additive-bases",
      "restricted-order",
      "combinatorics"
    ],
    "badge": "mathlib",
    "sorries": 2,
    "erdosNumber": 338,
    "erdosUrl": "https://erdosproblems.com/338",
    "erdosProblemStatus": "open"
  },
  "overview": {
    "historicalContext": "The study of additive bases is a central topic in additive number theory. The order of a basis is the minimum number of summands needed to represent all sufficiently large integers. The restricted order is similar but requires DISTINCT summands. This problem, posed by Erdős, explores the relationship between these two concepts. Kelly (1957) initiated the study by proving that order-2 bases have restricted order at most 4 and conjectured the bound is 3. Hennecart (2005) disproved Kelly's conjecture by constructing an order-2 basis with restricted order exactly 4. Hegyvári, Hennecart, and Plagne (2007) showed the gap between order and restricted order can grow exponentially.",
    "problemStatement": "The restricted order of a basis is the least integer t (if it exists) such that every sufficiently large integer is the sum of at most t distinct summands from A. The problem asks: (1) What are necessary and sufficient conditions for restricted order to exist? (2) Can restricted order be bounded in terms of order? (3) When does restricted order equal order? (4) If A \\ F is a basis for all finite F, must A have restricted order?",
    "proofStrategy": "The formalization defines additive basis of order h (using multisets for representations with repetition) and restricted order (using finite sets for distinct summands). Key results are axiomatized: Bateman's observation (order ≥ 3 doesn't guarantee finite restricted order), Kelly's theorem (order 2 implies restricted order ≤ 4), Hennecart's counterexample, and the HHP exponential lower bound. Classical examples include squares (order 4, restricted 5) and triangular numbers (order = restricted = 3). Basic properties like monotonicity and the implication from restricted to regular order are proved.",
    "keyInsights": [
      "Order allows repetitions (multisets); restricted order requires distinct elements (finite sets)",
      "Bateman's example A = {1} ∪ {x : h | x} shows order h ≥ 3 doesn't imply finite restricted order",
      "Kelly proved order 2 implies restricted order ≤ 4; his conjecture of ≤ 3 was disproved",
      "The gap between order and restricted order can grow exponentially: at least 2^{k-2} + k - 1 for order k",
      "Triangular numbers have equal order and restricted order; squares have order 4 but restricted order 5"
    ]
  },
  "sections": [
    {
      "id": "basic-defs",
      "title": "Basic Definitions",
      "startLine": 43,
      "endLine": 92,
      "summary": "Defines additive basis of order h, exact order, restricted representations, restricted order, and finite restricted order."
    },
    {
      "id": "bateman",
      "title": "Bateman's Observation",
      "startLine": 94,
      "endLine": 117,
      "summary": "Bateman's example showing order h ≥ 3 doesn't guarantee finite restricted order: A = {1} ∪ {x : h | x}."
    },
    {
      "id": "kelly",
      "title": "Kelly's Results (1957)",
      "startLine": 119,
      "endLine": 144,
      "summary": "Kelly's theorem (order 2 implies restricted order ≤ 4) and his disproved conjecture (≤ 3)."
    },
    {
      "id": "hennecart",
      "title": "Hennecart's Counterexample (2005)",
      "startLine": 146,
      "endLine": 167,
      "summary": "Hennecart constructed an order-2 basis with restricted order exactly 4, disproving Kelly's conjecture."
    },
    {
      "id": "examples",
      "title": "Classical Examples",
      "startLine": 169,
      "endLine": 213,
      "summary": "Squares (order 4, restricted 5) and triangular numbers (order = restricted = 3)."
    },
    {
      "id": "hhp",
      "title": "HHP Lower Bound (2007)",
      "startLine": 215,
      "endLine": 236,
      "summary": "For order k ≥ 2, restricted order can be at least 2^{k-2} + k - 1 (exponential gap)."
    },
    {
      "id": "open-questions",
      "title": "Open Questions",
      "startLine": 238,
      "endLine": 274,
      "summary": "The four main open questions: existence conditions, bounding, equality conditions, and robustness."
    },
    {
      "id": "properties",
      "title": "Basic Properties",
      "startLine": 276,
      "endLine": 318,
      "summary": "Properties: restricted implies regular order, order ≤ restricted order, and monotonicity."
    },
    {
      "id": "summary",
      "title": "Summary",
      "startLine": 320,
      "endLine": 361,
      "summary": "Summary theorem combining Kelly's theorem, the false conjecture, and classical examples."
    }
  ],
  "conclusion": {
    "summary": "Erdős Problem #338 remains OPEN. The main questions about characterizing when restricted order exists, bounding it in terms of order, and when they are equal are unsolved. Key partial results include: Kelly's bound of 4 for order-2 bases, Hennecart's counterexample to Kelly's conjecture of 3, Bateman's example showing order ≥ 3 doesn't guarantee finite restricted order, and the HHP exponential lower bound.",
    "implications": "The gap between order and restricted order reveals the fundamental difference between representations allowing repetitions and those requiring distinctness. The exponential gap in the HHP lower bound suggests there may be no polynomial bound on restricted order in terms of order. The problem connects to questions about robustness of additive bases.",
    "openQuestions": [
      "What are necessary and sufficient conditions for a basis to have finite restricted order?",
      "Can restricted order be bounded by a function of order (for bases that have restricted order)?",
      "What characterizes bases where order equals restricted order?",
      "If A \\ F is a basis for all finite F, must A have restricted order?"
    ]
  }
}
