{
  "id": "erdos-1068",
  "title": "Erdős Problem #1068: Countable Infinitely-Connected Subgraphs",
  "slug": "erdos-1068",
  "description": "Does every graph with chromatic number ℵ₁ contain a countable infinitely vertex-connected subgraph? Soukup (2015): uncountable sets can fail. Version of Erdős–Hajnal problem. Open.",
  "meta": {
    "erdosNumber": 1068,
    "status": "formalized",
    "tags": [
      "erdos",
      "graph-theory",
      "set-theory",
      "chromatic-number",
      "infinite-connectivity",
      "open"
    ],
    "references": [
      "Vatter (1999): Problem 7.90 [Va99]",
      "Erdős & Hajnal (1966): original problem [ErHa66]",
      "Soukup (2015): counterexample for uncountable sets [So15]",
      "Bowler & Pikhurko (2024): simplified construction [BoPi24]",
      "https://erdosproblems.com/1068"
    ],
    "leanFile": "Proofs/Erdos1068Problem.lean",
    "sorries": 0
  },
  "sections": [
    {
      "id": "definitions",
      "title": "Definitions",
      "startLine": 22,
      "endLine": 54,
      "summary": "Graph, path, internal disjointness, infinite connectivity, chromatic number."
    },
    {
      "id": "main-question",
      "title": "Main Question",
      "startLine": 56,
      "endLine": 63,
      "summary": "Does χ(G) = ℵ₁ force a countable infinitely-connected subgraph?"
    },
    {
      "id": "known-results",
      "title": "Known Results",
      "startLine": 65,
      "endLine": 80,
      "summary": "Soukup's counterexample for uncountable sets, Bowler–Pikhurko simplification."
    },
    {
      "id": "observations",
      "title": "Observations",
      "startLine": 82,
      "endLine": 98,
      "summary": "Erdős–Hajnal connection, strength of infinite connectivity, set-theoretic aspects."
    }
  ],
  "overview": {
    "historicalContext": "This problem is a variant of the Erdős–Hajnal problem from 1966, asking what structural consequences follow from large chromatic number. The specific formulation about countable infinitely-connected subgraphs appears in Vatter's 1999 problem collection. Soukup's 2015 counterexample shows the question is delicate.",
    "problemStatement": "Does every graph with chromatic number ℵ₁ contain a countable subgraph that is infinitely vertex-connected (any two vertices joined by infinitely many pairwise internally-disjoint paths)?",
    "proofStrategy": "We define infinite vertex-connectivity and chromatic number for infinite graphs, state the main question, and record Soukup's counterexample showing uncountable sets can fail to be infinitely connected.",
    "keyInsights": [
      "Infinite vertex-connectivity: any two vertices joined by ∞ many disjoint paths",
      "Soukup (2015): uncountable sets in high-chromatic graphs can be finitely connected",
      "The question specifically asks about countable subgraphs, not uncountable ones",
      "A variant of the Erdős–Hajnal problem (Problem #1067)",
      "May depend on set-theoretic axioms beyond ZFC"
    ]
  },
  "conclusion": {
    "summary": "Erdős Problem #1068 asks whether large chromatic number (ℵ₁) forces the existence of a countable infinitely-connected subgraph. Soukup's counterexample shows this fails for uncountable subsets, making the countable case the key open question.",
    "implications": "Resolution would advance the theory of infinite graph coloring and the Erdős–Hajnal program connecting chromatic number with structural graph properties.",
    "openQuestions": [
      "Does χ(G) = ℵ₁ force a countable infinitely-connected subgraph?",
      "Is the answer independent of ZFC?",
      "What is the weakest connectivity condition forced by large chromatic number?",
      "Does the answer change for χ(G) = ℵ₂ or higher?"
    ]
  }
}
