{
  "id": "erdos-72",
  "title": "Erdős Problem #72: Unavoidable Cycle Lengths",
  "slug": "erdos-72",
  "description": "Given a sparse set A of natural numbers and sufficiently high average degree, must every large graph contain a cycle whose length is in A? This $100 problem was solved affirmatively, with Liu and Montgomery's 2020 result contradicting Erdős's original intuition about powers of 2.",
  "meta": {
    "author": "Verstraëte (2005), Liu & Montgomery (2020)",
    "sourceUrl": "https://erdosproblems.com/72",
    "date": "2020",
    "status": "formalized",
    "proofRepoPath": "Proofs/Erdos72Problem.lean",
    "tags": [
      "graph-theory",
      "extremal-combinatorics",
      "erdos",
      "cycles",
      "density"
    ],
    "badge": "wip",
    "sorries": 3,
    "erdosNumber": 72,
    "erdosUrl": "https://erdosproblems.com/72",
    "erdosProblemStatus": "solved",
    "erdosPrizeValue": "$100",
    "relatedProblems": [
      {
        "id": "erdos-71",
        "relationship": "Bollobás's result on arithmetic progressions (referenced in problem statement)"
      }
    ]
  },
  "overview": {
    "historicalContext": "**The Quest for Unavoidable Cycle Lengths**\n\nErdős posed this $100 problem asking whether there exists a 'sparse' set A ⊂ ℕ (density 0) such that any sufficiently dense graph must contain a cycle with length in A. This connects extremal graph theory to number-theoretic properties of cycle length sets.\n\n**Key Historical Developments:**\n\n- **1977**: Bollobás proved the result for infinite arithmetic progressions containing even numbers\n- **2005**: Verstraëte gave a non-constructive existence proof for such a set A\n- **2020**: Liu and Montgomery proved the surprising result that A can be the powers of 2, directly contradicting Erdős's stated belief\n\n**Why Erdős Was Wrong**: Erdős was 'almost certain' that powers of 2 would not work, expecting that forcing specific cycle lengths would require average degree growing with graph size. Liu and Montgomery showed a constant threshold suffices.",
    "problemStatement": "**Problem Statement**\n\nIs there a set A ⊂ ℕ of density 0 and a constant c > 0 such that every graph on sufficiently many vertices with average degree ≥ c contains a cycle whose length is in A?\n\n**Clarification**: The set A must have density 0, meaning |A ∩ [1,n]|/n → 0 as n → ∞. The constant c must be independent of the graph size.\n\n**Answer**: YES. Multiple constructions exist:\n- Any infinite arithmetic progression with even numbers works (Bollobás 1977)\n- Powers of 2 work (Liu & Montgomery 2020)\n- More generally, any slowly-growing set of even numbers works",
    "proofStrategy": "**Proof Approach (Liu-Montgomery 2020)**\n\nThe Liu-Montgomery proof for powers of 2 uses sophisticated techniques from extremal combinatorics:\n\n1. **Regularity Methods**: Apply variants of Szemerédi's regularity lemma to decompose the graph into structured pieces\n\n2. **Cycle Detection**: Within regular pairs, analyze path structures to force cycles of specific lengths\n\n3. **Density Arguments**: Show that high average degree propagates through the regular decomposition, ensuring enough structure for cycle existence\n\n4. **Powers of 2 Property**: Exploit that powers of 2 are well-spaced enough that one must appear as a cycle length\n\n**Key Insight**: The sparsity of powers of 2 (only O(log n) values up to n) is counterbalanced by the structural richness that high average degree provides.",
    "keyInsights": [
      "Dense graphs force structural patterns that include specific cycle lengths",
      "The density 0 condition on A is crucial - A cannot be too 'thin' (like primes) or too 'thick'",
      "Powers of 2 work despite Erdős's intuition, showing even number sets with sub-polynomial growth suffice",
      "The problem connects extremal graph theory to number-theoretic properties of integer sets",
      "Non-constructive proofs (Verstraëte) preceded constructive ones (Liu-Montgomery)"
    ]
  },
  "sections": [
    {
      "id": "density",
      "title": "Density of Sets",
      "startLine": 40,
      "endLine": 63,
      "summary": "Definitions for counting functions, density 0, powers of 2, and arithmetic progressions"
    },
    {
      "id": "graph-defs",
      "title": "Graph Definitions",
      "startLine": 65,
      "endLine": 83,
      "summary": "Average degree, cycle lengths, and containing cycles from a target set"
    },
    {
      "id": "unavoidable",
      "title": "Unavoidable Cycle Lengths",
      "startLine": 85,
      "endLine": 97,
      "summary": "The key property: A is unavoidable if dense graphs must contain A-length cycles"
    },
    {
      "id": "main-problem",
      "title": "The Main Problem",
      "startLine": 99,
      "endLine": 108,
      "summary": "Erdős Problem #72: existence of density-0 unavoidable sets"
    },
    {
      "id": "known-results",
      "title": "Known Results",
      "startLine": 110,
      "endLine": 140,
      "summary": "Bollobás (1977), Verstraëte (2005), Liu-Montgomery (2020) as axioms"
    },
    {
      "id": "erdos-wrong",
      "title": "Erdős's Error",
      "startLine": 142,
      "endLine": 152,
      "summary": "Liu-Montgomery refuted Erdős's belief that powers of 2 wouldn't work"
    },
    {
      "id": "other-sets",
      "title": "Other Density-0 Sets",
      "startLine": 154,
      "endLine": 172,
      "summary": "Perfect squares and the open question of which sets are unavoidable"
    },
    {
      "id": "quantitative",
      "title": "Quantitative Bounds",
      "startLine": 174,
      "endLine": 185,
      "summary": "Optimal threshold and explicit bounds from Liu-Montgomery"
    },
    {
      "id": "generalizations",
      "title": "Generalizations",
      "startLine": 187,
      "endLine": 198,
      "summary": "Controlled growth sets and the general Liu-Montgomery theorem"
    }
  ],
  "conclusion": {
    "summary": "Erdős Problem #72 asked whether sparse sets of natural numbers can serve as 'unavoidable' cycle length sets in dense graphs. The answer is yes, proved non-constructively by Verstraëte (2005) and constructively for powers of 2 by Liu and Montgomery (2020). This contradicted Erdős's belief that powers of 2 would not work.",
    "implications": "**Theoretical Significance**\n\n1. **Extremal Graph Theory**: Demonstrates that high average degree forces rich cycle structure with specific length properties\n\n2. **Erdős's Intuition**: A rare case where Erdős's mathematical intuition was definitively wrong, showing the depth of the problem\n\n3. **Number Theory Connection**: Links graph density to number-theoretic properties of integer sets\n\n4. **Algorithmic Implications**: Suggests efficient cycle-finding algorithms in dense graphs may target specific length classes",
    "openQuestions": [
      "What is the optimal constant c for powers of 2?",
      "Which other density-0 sets work? What about perfect squares or {p±1 : p prime}?",
      "Can the proof be made algorithmic - given a dense graph, efficiently find a cycle of length 2^k?",
      "What happens for directed graphs or hypergraphs?",
      "Full Lean formalization of the Liu-Montgomery argument"
    ]
  }
}
