{
  "id": "erdos-441",
  "title": "Erdős Problem #441: LCM-Bounded Subsets",
  "slug": "erdos-441",
  "description": "Find the maximum size g(N) of A ⊆ {1,...,N} such that lcm(a,b) ≤ N for all a,b ∈ A. Is Erdős' construction optimal? Answer: NO - Chen and Dai proved for infinitely many N, the optimal set is strictly larger than Erdős' construction. The asymptotic g(N) ~ (9N/8)^{1/2} is known.",
  "meta": {
    "author": "Chen-Dai",
    "sourceUrl": "https://erdosproblems.com/441",
    "date": "2006-2007",
    "status": "complete",
    "proofRepoPath": "Proofs/Erdos441Problem.lean",
    "tags": [
      "erdos",
      "number-theory",
      "lcm",
      "extremal-combinatorics"
    ],
    "badge": "mathlib",
    "sorries": 2,
    "erdosNumber": 441,
    "erdosUrl": "https://erdosproblems.com/441",
    "erdosProblemStatus": "solved"
  },
  "overview": {
    "historicalContext": "Erdős proposed this problem in 1951, asking for the maximum size of a subset A of {1,...,N} where all pairwise LCMs are at most N. He conjectured that his specific construction (integers up to (N/2)^{1/2} combined with even integers in [(N/2)^{1/2}, (2N)^{1/2}]) would be optimal. The problem was studied by Choi (1972) and definitively resolved by Chen (1998) who established the asymptotic, and Chen-Dai (2006-2007) who proved the construction is not always optimal.",
    "problemStatement": "Let N ≥ 1. What is the size g(N) of the largest A ⊆ {1,...,N} such that lcm(a,b) ≤ N for all a,b ∈ A? Is the maximum attained by choosing all integers in [1, (N/2)^{1/2}] together with all even integers in [(N/2)^{1/2}, (2N)^{1/2}]?",
    "proofStrategy": "The formalization establishes the LCM-bounded property, defines Erdős' proposed construction, and captures the known bounds: lower bound g(N) ≥ (9N/8)^{1/2} - O(1) from the construction, upper bound g(N) ≤ (9N/8)^{1/2} + O((N/log N)^{1/2} · log log N) from Chen-Dai. The key result that the construction is not optimal for infinitely many N is stated as an axiom.",
    "keyInsights": [
      "The asymptotic g(N) ~ (9N/8)^{1/2} is tight",
      "The constant 9/8 arises from the structure of Erdős' construction",
      "For infinitely many N, optimal sets differ from Erdős' pattern",
      "The answer to Erdős' specific question is NO"
    ]
  },
  "sections": [],
  "conclusion": {
    "summary": "Erdős' question about whether his construction is optimal has a negative answer. While the asymptotic g(N) ~ (9N/8)^{1/2} established by Chen (1998) shows the construction gives the correct order of magnitude, Chen and Dai (2006) proved that for infinitely many N, the maximum LCM-bounded subset is strictly larger than Erdős' construction.",
    "implications": "The problem illustrates that natural constructions in extremal combinatorics may not be optimal, even when they achieve the correct asymptotic behavior. The gap between the construction and the optimal value, while o(√N), demonstrates subtle structure in the problem.",
    "openQuestions": [
      "What is the exact structure of optimal LCM-bounded sets?",
      "Can the O((N/log N)^{1/2} · log log N) error term be improved?",
      "For which specific N values is Erdős' construction suboptimal?"
    ]
  }
}
